app/controllers/productos_controller.rb

  def create
    @producto = Producto.new(producto_params)

    respond_to do |format|
      if @producto.save
---
INSERT INTO "productos" ("name", "unit_price", "stock", "category", "size", "color", "date_in_stock", "last_update", "delete_date", "created_at", "updated_at") VALUES ('Remera', 23.0, 1, '', '', '', NULL, NULL, NULL, '2024-11-28 19:56:46.623256', '2024-11-28 19:56:46.623256') RETURNING "id"

  def update
    respond_to do |format|
      if @producto.update(producto_params)
---
UPDATE "productos" SET "size" = 'M', "color" = 'Verde', "date_in_stock" = '2024-11-28 18:13:00', "updated_at" = '2024-11-28 21:14:12.875290' WHERE "productos"."id" = 1

    def set_producto
      @producto = Producto.find(params.expect(:id))
---
SELECT "productos".* FROM "productos" WHERE "productos"."id" = 1 LIMIT 1